coocox/Mplib/Toshaba/TMPM37x/TMPM370/cmsis_lib/lib/src/tmpm370_adc.c
}


/**
  * @brief  Set Timer Trigger Program Register of the specified ADC unit.
  * @param  ADx: Select ADC unit
  *   This parameter can be one of the following values:
  *     For M370:   TSB_ADA, TSB_ADB
  *     For M372/3/4:  TSB_ADB
  * @param  ResultREGx: Select which ADC result register will be used for the specified ADC unit.
  *   This parameter can be one of the following values(12 registers):
  *     ADC_REG0, ADC_REG1, ADC_REG2, ADC_REG3, ADC_REG4, ADC_REG5,
  *     ADC_REG6, ADC_REG7, ADC_REG8, ADC_REG9, ADC_REG10, ADC_REG11
  * @param  MacroAINx: Select AD Channel together with its enabled or disabled setting.
  *   This parameter must be inputed with macro as the format below:
  *     TRG_ENABLE(x), TRG_DISABLE(x).
  *   'x' above can be one of the following values:
  *   For M370 Unit A:
  *     ADC_AIN0, ADC_AIN1, ADC_AIN2, ADC_AIN3, ADC_AIN4, ADC_AIN5, ADC_AIN6,
  *     ADC_AIN7, ADC_AIN8, ADC_AIN9, ADC_AIN10, ADC_AIN11, ADC_AIN12,
  *     ADC_AIN13, ADC_AIN14
  *   For M370 Unit B:
  *     ADC_AIN0 to ADC_AIN14 same as Unit A, ADC_AIN15, ADC_AIN16 
  *   For M372: 
  *     ADC_AIN2, ADC_AIN3, ADC_AIN4, ADC_AIN5, ADC_AIN6, ADC_AIN7,
  *     ADC_AIN8, ADC_AIN9, ADC_AIN10, ADC_AIN11, ADC_AIN12
  *   For M373: 
  *     ADC_AIN2, ADC_AIN3, 
  *     ADC_AIN8, ADC_AIN9, ADC_AIN10, ADC_AIN11, ADC_AIN12  
  *   For M374: 
  *     ADC_AIN2, ADC_AIN3, 
  *     ADC_AIN9, ADC_AIN10, ADC_AIN11, ADC_AIN12   
  * @retval None
  */
void ADC_SetTimerTrg(TSB_AD_TypeDef * ADx, ADC_REGx ResultREGx, uint8_t MacroAINx)
{
    /* Check the parameters */
    assert_param(IS_ADC_UNIT(ADx));
    assert_param(IS_ADC_REGx(ResultREGx));

#if defined(__TMPM370_ADC_H)
    if (ADx == TSB_ADA) {
        assert_param(IS_UNIT_A_AINx(MacroAINx));
    } else {
        assert_param(IS_UNIT_B_AINx(MacroAINx));
    }
#else
    assert_param(IS_UNIT_B_AINx(MacroAINx));
#endif

    if (ResultREGx >= ADC_REG8) {
        proc_xSET(&ADx->TSET811, ResultREGx, MacroAINx);
    } else if (ResultREGx >= ADC_REG4) {
        proc_xSET(&ADx->TSET47, ResultREGx, MacroAINx);
    } else {
        proc_xSET(&ADx->TSET03, ResultREGx, MacroAINx);
    }
}


/**
  * @brief  Set Software Trigger Program Register of the specified ADC unit.
  * @param  ADx: Select ADC unit
  *   This parameter can be one of the following values:
  *     For M370:   TSB_ADA, TSB_ADB
  *     For M372/3/4:  TSB_ADB
  * @param  ResultREGx: Select which ADC result register will be used for the specified ADC unit.
  *   This parameter can be one of the following values(12 registers):
  *     ADC_REG0, ADC_REG1, ADC_REG2, ADC_REG3, ADC_REG4, ADC_REG5,
  *     ADC_REG6, ADC_REG7, ADC_REG8, ADC_REG9, ADC_REG10, ADC_REG11
  * @param  MacroAINx: Select AD Channel together with its enabled or disabled setting.
  *   This parameter must be inputed with macro as the format below:
  *     TRG_ENABLE(x), TRG_DISABLE(x).
  *   'x' above can be one of the following values:
  *   For M370 Unit A:
  *     ADC_AIN0, ADC_AIN1, ADC_AIN2, ADC_AIN3, ADC_AIN4, ADC_AIN5, ADC_AIN6,
  *     ADC_AIN7, ADC_AIN8, ADC_AIN9, ADC_AIN10, ADC_AIN11, ADC_AIN12,
  *     ADC_AIN13, ADC_AIN14
  *   For M370 Unit B:
  *     ADC_AIN0 to ADC_AIN14 same as Unit A, ADC_AIN15, ADC_AIN16 
  *   For M372: 
  *     ADC_AIN2, ADC_AIN3, ADC_AIN4, ADC_AIN5, ADC_AIN6, ADC_AIN7,
  *     ADC_AIN8, ADC_AIN9, ADC_AIN10, ADC_AIN11, ADC_AIN12
  *   For M373: 
  *     ADC_AIN2, ADC_AIN3, 
  *     ADC_AIN8, ADC_AIN9, ADC_AIN10, ADC_AIN11, ADC_AIN12  
  *   For M374: 
  *     ADC_AIN2, ADC_AIN3, 
  *     ADC_AIN9, ADC_AIN10, ADC_AIN11, ADC_AIN12  
  * @retval None
  */
void ADC_SetSWTrg(TSB_AD_TypeDef * ADx, ADC_REGx ResultREGx, uint8_t MacroAINx)
{
    /* Check the parameters */
    assert_param(IS_ADC_UNIT(ADx));
    assert_param(IS_ADC_REGx(ResultREGx));
#if defined(__TMPM370_ADC_H)
    if (ADx == TSB_ADA) {
        assert_param(IS_UNIT_A_AINx(MacroAINx));
    } else {
        assert_param(IS_UNIT_B_AINx(MacroAINx));
    }
#else
    assert_param(IS_UNIT_B_AINx(MacroAINx));
#endif

    if (ResultREGx >= ADC_REG8) {
        proc_xSET(&ADx->SSET811, ResultREGx, MacroAINx);
    } else if (ResultREGx >= ADC_REG4) {
        proc_xSET(&ADx->SSET47, ResultREGx, MacroAINx);
    } else {
        proc_xSET(&ADx->SSET03, ResultREGx, MacroAINx);
    }
}


/**
  * @brief  Set Constant Trigger Program Register of the specified ADC unit.
  * @param  ADx: Select ADC unit
  *   This parameter can be one of the following values:
  *     For M370:   TSB_ADA, TSB_ADB
  *     For M372/3/4:  TSB_ADB
  * @param  ResultREGx: Select which ADC result register will be used for the specified ADC unit.
  *   This parameter can be one of the following values(12 registers):
  *     ADC_REG0, ADC_REG1, ADC_REG2, ADC_REG3, ADC_REG4, ADC_REG5,
  *     ADC_REG6, ADC_REG7, ADC_REG8, ADC_REG9, ADC_REG10, ADC_REG11
  * @param  MacroAINx: Select AD Channel together with its enabled or disabled setting.
  *   This parameter must be inputed with macro as the format below:
  *     TRG_ENABLE(x), TRG_DISABLE(x).
  *   'x' above can be one of the following values:
  *   For M370 Unit A:
  *     ADC_AIN0, ADC_AIN1, ADC_AIN2, ADC_AIN3, ADC_AIN4, ADC_AIN5, ADC_AIN6,
  *     ADC_AIN7, ADC_AIN8, ADC_AIN9, ADC_AIN10, ADC_AIN11, ADC_AIN12,
  *     ADC_AIN13, ADC_AIN14
  *   For M370 Unit B:
  *     ADC_AIN0 to ADC_AIN14 same as Unit A, ADC_AIN15, ADC_AIN16 
  *   For M372: 
  *     ADC_AIN2, ADC_AIN3, ADC_AIN4, ADC_AIN5, ADC_AIN6, ADC_AIN7,
  *     ADC_AIN8, ADC_AIN9, ADC_AIN10, ADC_AIN11, ADC_AIN12
  *   For M373: 
  *     ADC_AIN2, ADC_AIN3, 
  *     ADC_AIN8, ADC_AIN9, ADC_AIN10, ADC_AIN11, ADC_AIN12  
  *   For M374: 
  *     ADC_AIN2, ADC_AIN3, 
  *     ADC_AIN9, ADC_AIN10, ADC_AIN11, ADC_AIN12  
  * @retval None
  */
void ADC_SetConstantTrg(TSB_AD_TypeDef * ADx, ADC_REGx ResultREGx, uint8_t MacroAINx)
{
    /* Check the parameters */
    assert_param(IS_ADC_UNIT(ADx));
    assert_param(IS_ADC_REGx(ResultREGx));
#if defined(__TMPM370_ADC_H)
    if (ADx == TSB_ADA) {
        assert_param(IS_UNIT_A_AINx(MacroAINx));
    } else {
        assert_param(IS_UNIT_B_AINx(MacroAINx));
    }
#else
    assert_param(IS_UNIT_B_AINx(MacroAINx));
#endif

    if (ResultREGx >= ADC_REG8) {
        proc_xSET(&ADx->ASET811, ResultREGx, MacroAINx);
    } else if (ResultREGx >= ADC_REG4) {
        proc_xSET(&ADx->ASET47, ResultREGx, MacroAINx);
    } else {
        proc_xSET(&ADx->ASET03, ResultREGx, MacroAINx);
    }
}

/** @} */
/* End of group ADC_Exported_Functions */

/** @} */
/* End of group ADC */

/** @} */
/* End of group TX03_Periph_Driver */

#endif                          /* defined(__TMPM370_ADC_H) */
